sample/hashi/1bench-multiparam/nomad-sn-wrk-mixed-c6525-25g-exp12-havail0-hori1-verti1-infi1-t4-c512-d60-R10000
Using argument nginx
using  args: threads=4 and connections=512 and duration=60 and requests=10000
Running 1m test @ http://10.10.1.4:8080
  4 threads and 512 connections
  Thread calibration: mean lat.: 1.216ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.248ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.220ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.883ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   790.68us    0.98ms   4.47ms   90.05%
    Req/Sec     2.64k   543.03     4.00k    70.02%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  499.00us
 75.000%  695.00us
 90.000%    1.76ms
 99.000%    4.47ms
 99.900%    9.70ms
 99.990%   22.51ms
 99.999%   38.14ms
100.000%   53.57ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.257     0.000000            1         1.00
       0.365     0.100000        51511         1.11
       0.387     0.200000       100100         1.25
       0.410     0.300000       151175         1.43
       0.439     0.400000       200003         1.67
       0.499     0.500000       249835         2.00
       0.553     0.550000       275019         2.22
       0.590     0.600000       299730         2.50
       0.621     0.650000       324616         2.86
       0.654     0.700000       349469         3.33
       0.695     0.750000       374382         4.00
       0.721     0.775000       387038         4.44
       0.754     0.800000       399563         5.00
       0.798     0.825000       411891         5.71
       0.866     0.850000       424389         6.67
       1.000     0.875000       436763         8.00
       1.177     0.887500       442992         8.89
       1.758     0.900000       449230        10.00
       1.963     0.912500       455480        11.43
       2.169     0.925000       461745        13.33
       2.399     0.937500       467974        16.00
       2.519     0.943750       471059        17.78
       2.653     0.950000       474224        20.00
       2.799     0.956250       477330        22.86
       2.971     0.962500       480432        26.67
       3.173     0.968750       483537        32.00
       3.287     0.971875       485096        35.56
       3.415     0.975000       486654        40.00
       3.563     0.978125       488234        45.71
       3.739     0.981250       489779        53.33
       3.951     0.984375       491332        64.00
       4.075     0.985938       492122        71.11
       4.203     0.987500       492891        80.00
       4.367     0.989062       493682        91.43
       4.563     0.990625       494471       106.67
       4.775     0.992188       495243       128.00
       4.903     0.992969       495627       142.22
       5.051     0.993750       496011       160.00
       5.227     0.994531       496406       182.86
       5.439     0.995313       496803       213.33
       5.687     0.996094       497182       256.00
       5.823     0.996484       497377       284.44
       5.975     0.996875       497573       320.00
       6.183     0.997266       497769       365.71
       6.467     0.997656       497961       426.67
       6.795     0.998047       498156       512.00
       7.075     0.998242       498255       568.89
       7.435     0.998437       498353       640.00
       7.811     0.998633       498448       731.43
       8.727     0.998828       498547       853.33
      10.023     0.999023       498643      1024.00
      10.959     0.999121       498692      1137.78
      12.615     0.999219       498741      1280.00
      14.871     0.999316       498789      1462.86
      15.415     0.999414       498838      1706.67
      15.639     0.999512       498887      2048.00
      15.791     0.999561       498912      2275.56
      15.943     0.999609       498937      2560.00
      16.175     0.999658       498960      2925.71
      16.671     0.999707       498984      3413.33
      17.631     0.999756       499009      4096.00
      18.207     0.999780       499021      4551.11
      18.655     0.999805       499033      5120.00
      19.311     0.999829       499045      5851.43
      20.367     0.999854       499057      6826.67
      21.215     0.999878       499070      8192.00
      21.567     0.999890       499076      9102.22
      22.783     0.999902       499082     10240.00
      23.647     0.999915       499088     11702.86
      26.079     0.999927       499094     13653.33
      27.871     0.999939       499100     16384.00
      28.815     0.999945       499103     18204.44
      29.599     0.999951       499106     20480.00
      31.151     0.999957       499109     23405.71
      31.551     0.999963       499112     27306.67
      32.639     0.999969       499115     32768.00
      34.591     0.999973       499117     36408.89
      35.647     0.999976       499118     40960.00
      36.447     0.999979       499120     46811.43
      37.087     0.999982       499121     54613.33
      37.343     0.999985       499123     65536.00
      37.599     0.999986       499124     72817.78
      37.599     0.999988       499124     81920.00
      38.143     0.999989       499125     93622.86
      38.911     0.999991       499126    109226.67
      39.039     0.999992       499127    131072.00
      39.039     0.999993       499127    145635.56
      39.039     0.999994       499127    163840.00
      39.583     0.999995       499128    187245.71
      39.583     0.999995       499128    218453.33
      43.359     0.999996       499129    262144.00
      43.359     0.999997       499129    291271.11
      43.359     0.999997       499129    327680.00
      43.359     0.999997       499129    374491.43
      43.359     0.999998       499129    436906.67
      53.567     0.999998       499130    524288.00
      53.567     1.000000       499130          inf
#[Mean    =        0.791, StdDeviation   =        0.976]
#[Max     =       53.536, Total count    =       499130]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  597467 requests in 1.00m, 114.30MB read
Requests/sec:   9957.78
Transfer/sec:      1.91MB